# DataFrames:

In [3]:
import pandas as pd
import numpy as np

In [ ]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

df = pd.DataFrame(data) # creates dataframe from a dictonary
print(df)

# no of rows are knwn as samle size
# columns known as featers

print("\nShape of the DataFrame: ",df.shape) 
print("\nSIze of the DataFrame: ",df.size) 
print("\nOther important info about the DataFrame: \n") 
df.info()  # call this function to get all the information about data frames

# perform some standrad operation on the df and gives a basic idea about the df
print("\n described data frame:")
df.describe()
# checks only those columns which as int or float dataype

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

Shape of the DataFrame:  (6, 4)

SIze of the DataFrame:  24

Other important info about the DataFrame:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

 described data frame:

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

### .head() & .tail()
   to get n elements from start or end

In [10]:
print("From start:\n\n", df.head(2))  # .head(n) gives first rows from the start
print("\nFrom end:\n\n", df.tail(3))  # .tail(n) gives last rows from the last

From start:

     Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

From end:

     Name   Age Department   Salary
3  David   NaN         IT  62000.0
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

### .loc[ ] and .iloc[ ]
to get a particular rows or columns

In [27]:
print("Elements from indes 1 to 3: ")
print(df.iloc[1:4])  # returns desiered rows with all columns
# to get both desired rows and column using iloc[]
print("\nSalarys of the Employees: ")
print(df.iloc[1:4, 3:]) 

print("\nNames and Age of the Employees: ")
# in loc[] two parameters can be passed one for the rows and second one for the columns
print(df.loc[1:3, ["Name", "Age"]])  # returns desired rows and also desired columns

Elements from indes 1 to 3:
      Name   Age Department   Salary
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0

Salarys of the Employees:
    Salary
1  60000.0
2  70000.0
3  62000.0

Names and Age of the Employees:
      Name   Age
1      Bob  30.0
2  Charlie  35.0
3    David   NaN

### .drop()
to remove an entire row or column from DataFrame

In [ ]:
# axis 1 for column 0 for rows
# this removed entire age column from df
print(df.drop("Age", axis=1, inplace=False))  # this returns a coppy of our origional df
# inplace=False set it true if want to change origional df by default its false

print("\n", df)  # here age is still in data beause that was just a coppy

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

       Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

### Brodcasting in Pandas

In [56]:
# lets increase the salarys of all employee by 5000

print("Original Salary: \n", df["Salary"])

df["Salary"] = df["Salary"] + 5000
# it updates in the origional dataframe made no coppys
# this adds 5000 in everyones salary like an loop

print("\nUpdated Salary: \n", df["Salary"])

Original Salary:
 0    65003.0
1    75003.0
2    85003.0
3    77003.0
4        NaN
5    65003.0
Name: Salary, dtype: float64

Updated Salary:
 0    70003.0
1    80003.0
2    90003.0
3    82003.0
4        NaN
5    70003.0
Name: Salary, dtype: float64

### Renaming columns

In [ ]:
# lets change a name of the column   Department to Dept

df.rename(columns={"Department": "Dept"}, inplace=True)
# we added inplace=True so it changes in the main df instead of amking a copy
print(df) # here Department changed into Dept

      Name   Age     Dept   Salary
0    Alice  25.0       HR  70003.0
1      Bob  30.0       IT  80003.0
2  Charlie  35.0  Finance  90003.0
3    David   NaN       IT  82003.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  70003.0

### .unique()
to find the unique values

In [ ]:
print("Departments in office: ", df["Dept"].unique())
# returns only the unique values ignores dublicate values

Departments in office:  ['HR' 'IT' 'Finance']

### .value_count()
distribution of one particular column across the data set

In [ ]:
print("People working across all departments:\n",df["Dept"].value_counts()) 
# counts all rows in Dept column and returns their counts

People working across all departments:
 Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64